app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hallowaaaa"], ["body", "Heyyyy guyysss!!"], ["user_id", 1], ["created_at", "2021-02-22 13:46:55.566968"], ["updated_at", "2021-02-22 13:46:55.566968"]]
---
  def create
    @posts = current_user.posts.build(params_filter)

    if @posts.save

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all